app/views/carts/index.html.erb

SELECT "product_orders".* FROM "product_orders" WHERE "product_orders"."order_id" = ?  [["order_id", 1]]
---
          <tbody>
            <% current_order.product_orders.each do |product_order| %>