app/controllers/static_pages_controller.rb

  def home
    @products = Product.order("created_at desc").paginate(page: params[:page], per_page: 20)
    @best_products = Product.best_product.limit 3
---
SELECT COUNT(*) FROM "products"
SELECT  "products".* FROM "products" ORDER BY created_at desc LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]