app/views/layouts/_header.html.erb

                  <li class="single-shopping-cart">
                    <% current_order.product_orders.each do |product_order| %>
---
SELECT "product_orders".* FROM "product_orders" WHERE "product_orders"."order_id" = ?  [["order_id", 1]]

                  <ul class="submenu">
                    <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"